{
  "posts": [
    {
      "id": 1,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Important Information for those (All too frequent) Pharmacy Visits",
      "author": "Janelle Leavell",
      "description": "Typically, as we age, we tend to end up taking more and more medication.",
      "date": "26 February 2015",
      "body": "Typically, as we age, we tend to end up taking more and more medication. Sometimes these medicines are over the counter, and many times these medications are prescribed by a doctor. We should know this, that these medications exist to help us all live hopefully healthier, longer lives. What we don’t all know, are some questions you should try to ask every time you pick up a medication from the pharmacy. Those who work at the pharmacy are there for many reasons, one being to answer your questions. If the initial person you speak to is unable to answer any of your questions, they will normally do their best to find someone else who can. Nobody can blame you for trying to keep yourself or your loved ones healthy and balanced. Below are 5 basic questions that you should be asking your pharmacist when you go pick up medications. You can always ask these same questions if purchasing anything over the counter, even vitamins- as that fine print can, at times, be mind boggling. Thanks to seniorific.com for the information below! 1)      What should you expect from the medication? Will this medication have side effects? Does it typically take 1 day, 3 days, or 5 days before many people start to notice much of a difference? Are there any real “red flags”, as in potentially very dangerous side effects you should be on the lookout for? 2)      How long should I take this medication before I call my doctor? This can also be a good question for those purchasing something over the counter. Should you deal with those symptoms for 1 week, 2 weeks, or longer while taking this medicine if you still haven’t noticed much of a benefit? When is it appropriate to give your primary care physician a call to see  if more tests and/or a visit to the doctor’s office is necessary? 3)      How do I manage my condition? Or how do I help my loved one manage their condition? Use the pharmacist for their brilliant brains! They can not only give you advice about the actual medication you will be taking, but also on how to modify yours, or someone that you love’s, lifestyle. While medication may be assisting with your blood pressure or helping regulate pain, the pharmacist may be able to tell you to increase you uptake in water, or increase your daily walking to help you really get the most out of your medication. 4)      Do these certain medicines mix? This is a great question. Many people are taking more than one medication, both prescribed AND over the counter. So it’s always a good idea to see if your newly prescribed medication as well as the plethora of other medicines in your cabinet will not do some sort of science experiment in your guts and make you sick. This is always a great question to ask. We ask that many of our seniors take lists of their medications to doctors appointments because truly, most of us can’t remember names and dosages perfectly. 5)      What should I do about my persistent, minor symptoms? Again, pick your pharmacists brain. With this question, they can either point you in the right direction for an over the counter remedy, or actually point out to you that that specific symptom isn’t so minor, and you may actually want to see a doctor for it. I hope this list will stay fresh in your brain. It’s important not only to know WHO to ask, but WHAT to ask as well. With most of us living longer lives, our lists of medications we take are growing and it’s up to us to ask the right questions to keep our medicine cabinets straight. Many medications are provided from multiple doctors, and unless we keep them advised, they won’t know what we are or aren’t taking. Use that friendly pharmacist to make sure you’re managing everything as best as you can.",
      "categories": ["Medication", "Dealing with Age", "Pharmnacy"]
    },
    {
      "id": 2,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Osteoporosis",
      "author": "Margie Hibner",
      "description": "I enjoy continuing my education and staying up to date on health related news, especially as it relates to the senior population.",
      "date": "27 January 2015",
      "body": "I enjoy continuing my education and staying up to date on health related news, especially as it relates to the senior population. If you stumbled across our website, it’s probably because you care deeply for one, or a few, seniors of your own! Below is a brief update for you guys on some things relating to osteoporosis. For awhile, osteoporosis was a hot topic, but it seems to have fizzled out recently. Let’s light that fire again. Osteoporosis can be defined simply as decreased bone mass. It can also be defined very difficult(ly), but we’ll leave that to the pro’s. At a certain point throughout our lifetime, old bone is removed from our skeleton faster than new bone can be added. When we are young, we add bone faster than we lose it. Women end up at an increased risk of being diagnosed with osteoporosis partly due to menopause, as bone loss occurs quickly in the few years after menopause. 10 million people in the United States are already diagnosed with osteoporosis and 34 million people have low bone mass, meaning they are at increased risk of developing the disease in the future. Low bone mass does not always mean osteoporosis, when a physician gets the result back from a DEXA scan, the “T Score” gives the doctor more information about HOW low the patient’s bone mineral density is. The current figure, according to the NIH, is that one out of every two women and one in four men over the age of 50 will have a fracture due to osteoporosis in their lifetime. This number is startling, as we all know the negative effects fractures, specifically hip and spine fractures can have on our elderly loved ones. Let’s take a look at some risk factors associated with a person developing osteoporosis. Many people who end up diagnosed with osteoporosis have risk factors, while some don’t have any. Gender- women are more likely to develop osteoporosis, but don’t ever forget that men can, and absolutely do get diagnosed as well Age- the older you are, the greater your risk! Body Size- smaller body types are at greater risk Ethnicity- Caucasian and Asian women are at greatest risk Family History- it has been found that families that have a history of fractures tend to continue that trend as well as have lower bone masses The above noted risk factors are those that you cannot change, but factors that can be kept in mind if you’re keeping an eye out for someone you love and trying to stay ahead of the game. Below are more risk factors that you can change, so take action or bring issues to light if you think it could be helpful for your elderly friend or family member. Sex hormones- low estrogen, low testosterone, and others lead to osteoporosis Anorexia- this eating disorder can increase one ‘s risk Calcium and vitamin D intake- decreased intake of vitamin D and calcium, generally throughout a lifetime, can increase risk Medication use- long term use of glucocorticoids and some anticonvulsants can increase a person’s risk Lifestyle, Cigarette Smoking, and Alcohol Intake- inactive lifestyle or (ugh) bed rest, which we know can occur with our loved ones too quickly or too often, can unfortunately lead to a decrease in bone mass. Excessive consumption of alcohol and/or cigarettes increases risk of bone loss. Encourage those that you know to get on their feet and go for a walk, as regular exercise can help maintain bone mass. Take note of the above factors listed (thanks again to the NIH), and make some changes both for you- it’s never to early to start- to clean up your life style and reduce you/your loves ones risk of being diagnosed with osteoporosis in the future. Osteoporosis is often called a “silent” disease because most people don’t present with symptoms until a fracture occurs, yikes! So get a head start, educate yourself, and change the risk factors you can, and make a mental note for those that you can’t. Be progressive while at the doctor’s office and ask what they think about your loved one’s chance of having osteoporosis and see if they recommend a DEXA scan if someone you love has multiple risk factors. It’s always beneficial to be pro active while seeing the physician if you have concerns, especially when it has to do with the health of you or the ones you love. Knowledge is power!",
      "categories": ["Bone Health", "Education"]
    },
    {
      "id": 3,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Let’s Help Recall Those Memories",
      "author": "Margie Hibner",
      "description": "Selfishly, we all get a little upset and sad when our elderly loved ones don’t recognize us or recall some of our favorite memories. ",
      "date": "13 January 2015",
      "body": "Selfishly, we all get a little upset and sad when our elderly loved ones don’t recognize us or recall some of our favorite memories. Unfortunately, it can be a part of aging, or due to dementia or Alzheimer’s disease. Fortunately for you and myself, after asking for some suggestions from other people in the medical field and browsing the internet, I’ve found some great tips on how to help recall some of those memories and get your loved one talking about the past.<br />Tip #1- use a person’s ability to smell. While talking about an old event may not trigger a vision in your loved ones mind, often times smelling something familiar can help. If you know grandpa loves oatmeal cookies, bake a batch and bring them over and see if you can then get him talking about how people used to bring cookies to the firehouse, or how grandma used to bake oatmeal cookies while the kids were off in school. Other scents such as familiar flowers and perfumes can also trigger strong memories. Help grandpa recall that happy memory by bringing around a familiar scent, or even a familiar taste.<br />Tip #2-  try to use music or familiar sounds. Often times music is powerful enough to prompt one with memory loss to recall an old scene, and if that isn’t the case, it can often have a calming effect on the same population. Next time you are visiting great uncle Bob, use your phone to pull up Pandora or download some “Dionne Warwick” or “The Foundations” and see if it takes Uncle Bob back to a high school dance or a date with his wife. It is also possible to purchase “The Andy Griffith Show” or “Perry Mason” for your love one, and even the sound of it playing in the background may be pleasing or help recall an enjoyable memory. Even if playing familiar sounds doesn’t remind your loved one of anything in particular, it can be fun to play some old tunes or shows and dance around with family or friends for entertainment for everyone.<br />Tip #3- Photos. Pictures, old letters, old Christmas cards. Putting any of these on display can help a loved one access a fond memory or two. You can even create a box full of familiar, tangible items including photos. This box can be filled with familiar loved jewelry, books, ornaments, scarves, baseballs, etc. All of these tangible items may be able to take your loved one back in time to when they first received those items.<br />Tip #4- Guide them with conversation. Use open ended questions to ask about familiar event s from when they were younger. “What sports did they like to play in highschool? What was your favorite family vacation? What is the most important lesson you learned from life?” Ask questions that lead them to think back, but encourage sharing rather than forcing them to recall events. These kinds of questions let them answer with as little or as much detail as they are comfortable with.<br />So take some of these tips and tricks with you next time you go visit your elderly loved ones. It’s lovely hearing old stories both about history in general, but especially hearing stories with a more personal touch. Using these prompts, you just may learn a great lesson about life or get an unforgettable story from your family member.",
      "categories": ["Dimentia", "Loved Ones", "Memories"]
    },
    {
      "id": 4,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Maybe They Wont Have to Turn up That Hearing Aid",
      "author": "Margie Hibner",
      "description": "I think most of us can agree that many of our elderly family members are hard of hearing, or are certainly headed in that direction.",
      "date": "20 November 2014",
      "body": "I think most of us can agree that many of our elderly family members are hard of hearing, or are certainly headed in that direction. It can be part of aging, so it’s nothing that should cause panic, but it’s an issue that can certainly be addressed with a doctor if you and your family member find it necessary or perhaps think there is more to the issue. Even with all of the equipment and assistance that is provided to our elders now to assist them with their hearing, I’ve found some ways that we can help them hear better as well- without all of that technology.<br />Here are some simple tips for making communication more clear with your loved one whose hearing may be less than perfect:<br />Increase lighting in the room so that your loved one can see your mouth better to assist them in making out your words<br />Make sure you are facing the senior so that they get a full view of your face and mouth<br />Slow down your speech and make sure not to speak in run on sentences. Take longer pauses between sentences to make sure you have been understood<br />Avoid shouting or talking suuuuuuuper sllooooowwwly and exaggerating mouth movements. This will confuse your loved one as much as rapid talking will!<br />Find out if one ear is better than the other when it comes to listening. Then use that information to try to speak more into the ear that will hear what you are saying best<br />Speak less with your hands and keep your hands away from your face. Talking, chewing gum, eating food, etc, all makes reading your lips that much more difficult<br />Remember that your loved one will have an even HARDER time hearing you when they are tired or aren’t feeling well. Understand this and write down important information to make sure that the senior will not only receive the information, but retain it as well.<br />This seems like a no brainer, but get rid of background noise. Turn off the radio, TV, or move to a quiet room. Other people’s voices are a big distraction and make hearing what you say that much more difficult for them.<br />I hope that these ideas are helpful for you as you continue to communicate with your loved one who is suffering from some hearing loss. Try not to get frustrated with talking, and instead get creative with the ways you are communicating and minimize distractions. Put yourself in the seniors’ shoes and see if you can figure out why it is so difficult for them to read your lips or understand what you are saying.<br />As a related side note: check out aarp.org’s bulletin for “Paying for Your Hearing Aid.” This is a great article with ways to assist in paying for hearing aids for seniors. Perhaps you’re waiting on purchasing hearing aids for your loved senior for financial reasons. If that’s the case, or you are just interested in finding ways to save money on expensive hearing aids, check out the article above.",
      "categories": ["Hearing", "Hearing Aids"]
    },
    {
      "id": 5,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Men and Assisted Living",
      "author": "Margie Hibner",
      "description": "Men are people too, so they deserve just as much love, respect, and consideration of their needs when picking out assisted living for them!",
      "date": "28 October 2014",
      "body": "Men are people too, so they deserve just as much love, respect, and consideration of their needs when picking out assisted living for them! As we continue to live longer, men included, we need to take special care that the places our parents want to live while receiving some assistance include some activities for men.<br />Many retirement homes, assisted living centers, and adult foster homes are starting to pay a little more attention to adding more “manly” activities to their recreational lists. When we think about the things we’ve seen most in nursing homes/assisted living and adult foster homes through the years, it’s women getting their hair done, manicures/pedicures, tea time, and some dancing. This is not to say that some men don’t enjoy those activities- but in the past, most activities have been geared toward women. Some homes are making sure to include activities like Wii bowling, horse races, outings to baseball games, and poker tournaments. Start keeping your eyes open, or ask questions about places that take men to pool halls, have pool tables, putting greens, or like to take their residents out on fishing trips. Assisted living doesn’t have to be boring, and a company that excels at keeping your loved one safe, happy, and healthy, are of utmost importance. Also understand that hobbies that your ‘man’ used to be interested in may not peak his interest anymore. This means that family may need to team up with facilities to create activities he might like. Also keep in mind that sometimes they just want to be entertained or in one on one situations. Remember that we all love to be entertained and participate in some hobbies, so be picky and find a place that you know will cater to your loved ones needs.<br />Many have said that it can be more difficult to get men involved in group recreational activities. Women tend to be social creatures, more so than men, so getting men together for an “outing” or trying to get them to share their hunting stories over coffee can require some extra help. Once you’ve found a fabulous place for your parents to live, take a look yourself into their extracurricular activities by finding and talking to staff or administrators to put the cherry on top of their new living situation!<br />Forget a little about history, and realize that times are changing and everyone is trying to keep up! Many homes and centers have realized that their activities have been outdated and geared toward women and they are proud of the changes they’ve made and their new events and undertakings. Make sure you, your father, brother, or manly loved one takes advantage of the many opportunities we are trying to provide to keep them happy and content!",
      "categories": ["Men in Assisted Living", "Care"]
    },
    {
      "id": 6,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "“Prehab”",
      "author": "Margie Hibner",
      "description": "This new nickname it popping up all around the internet and amongst friends and family.",
      "date": "14 October 2014",
      "body": "This new nickname it popping up all around the internet and amongst friends and family. Truly though, it’s nothing new in the physical therapy community. I know in my years as a therapist, we have always preached that the stronger, more flexible, and healthier you are either before an injury or surgery, the faster you will recover. In my experience, I have seen many orthopedic surgeons getting on board with this. I’ve had surgeons specifically request therapy care to not only address musculoskeletal issues, but educational pieces for their patients as well. We can help assist patients in counseling them on what to expect, precautions, as well as how to improve safety around the home specifically for post operative care. It looks like all of this “prehab” is being further researched and it could save some insurance companies, as well as patients, some money and time. Luckily for us therapists, and even more so for our patients, the theory of improved health, specifically joint health and pre operatively, leading to better outcomes is proving to be so very right!<br />Prehabilitation, or prehab, is the term coined for physical therapy before an elective surgery. Injuries or wear and tear can cause an increase in swelling, decrease your balance, decrease your strength, and your range of motion. Physical therapy can help improve all of these things, and the better these are before surgery, the better, and faster you’ll recover after an operation. If you’re very, very weak before surgery, the path to increasing strength post operatively can be painstakingly slow. If we can improve that strength for a few session before surgery, your starting point for strength will be MUCH higher and getting enough strength to walk or perform stairs will be that much easier! If the issue is swelling, physical therapy can use both modalities, and patient education to assist in decreasing this before surgery as well. The possibilities of how we can help you are endless, and it’s up to each individual therapist to perform an evaluation and see exactly what each person needs in regards to care.<br />It looks like most research is being done towards physical therapy before elective joint surgeries. This is a great start, as these surgeries are becoming more and more popular as their success rates rise and we continue to live longer and more actively, meaning our joints are needing a little more help! The most recent study I’ve seen is in the Journal of Bone and Joint Surgery, October 2014 Issue. This study has gone on to show that pre operative therapy before a total hip and total knee replacement can actually decrease the cost of post operative care by 30%. It also showed that about 55% of those who received preoperative therapy needed post acute care services, versus almost 80% of those who didn’t receive pre operative therapy needing post acute care services. Post acute care in this study is defined as skilled nursing facilities, home health agencies, or inpatient rehabilitation facilities. These are known to be expensive forms of care in the physical therapy and Medicare world. The pre operative therapy in this study was typically limited to 1-2 sessions.<br />Hopefully we continue to gather more information about the benefit of physical therapy before surgeries. It’s looking like it will not only benefit the patient, but the insurance company and payers as well. Take this information home with you and use your new knowledge at your next doctor’s appointment. If you or a loved one are planning on an elective joint surgery soon, talk to your doctor about the possibility of some physical therapy before the surgery date. It’s looking like it is what’s best for everyone!",
      "categories": ["Rehab", "Preventative Care"]
    },
    {
      "id": 7,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Volunteering and Seniors",
      "author": "Margie Hibner",
      "description": "It doesn’t just HAVE to be for seniors, many of us have experienced it with a little bit of empty nest syndrome.",
      "date": "30 September 2014",
      "body": "It doesn’t just HAVE to be for seniors, many of us have experienced it with a little bit of empty nest syndrome. We spend far too much time in our lives creating lists, and then checking boxes off of those lists. Suddenly we get some free time: vacation, kids go off to school, or we retire, and we don’t know what to do with ourselves.<br />Since I’m passionate about Seniors, I’ll gear this blog more towards ways to fill up some of our beloved seniors free time. Often, Seniors can be limited by mobility or energy, but a lot of volunteer programs are already geared toward seniors, and can allow our loved ones to use their great intellect and pull from their life experiences to do what they are passionate about. Below I’ll list some of the senior volunteer services I have heard about.<br />Through AmeriCorps, there are a multitude of volunteer programs geared towards adults. Within the SeniorCorps program alone and within Oregon, there have been over 6,000 volunteers over 26 programs.<br />RSVP. This is a large volunteer network for people aged 55 years and older. This means you don’t even need to be a “senior.” Yes I said it, over 55 isn’t “old.” RSVP offers chances for people to mentor disadvantaged youth, organize neighborhood watch programs, teach immigrants English, or help victims of natural disasters. My father loved to be hands on and my goodness he would’ve loved to get in there and fix things for those in need. How many of us have mothers or sisters who are retired teachers and have a WEALTH of knowledge about English, or other subjects that could be passed on.<br />Foster Grandparents. This is an opportunity for those again, over 55 years of age, to assist children and youth within their community. Within this program, our seniors can mentor troubled children, or provide care for premature infants or disabled children. I can’t say that I know many people who don’t just MELT when they are around babies. If your loved one fits into this category, take a peek into the foster grandparents program.<br />There are also a multitude of local volunteer opportunities through the Marion County Retired and Senior Volunteer program and the AARP. There are opportunities to teach financial literacy classes, teach gardening classes (I’m going to estimate this class would be right up the alley of about 75% of our mothers and grandmothers), become volunteer quilters, become GED tutors, and opportunities to volunteer at local libraries. The opportunities really range with these groups, and can help your loved one be more active, indulge in what they love, or just pass the time.<br />The benefits of many of these programs is the diversity of options, again catering to what your loved one may want to spend their free time doing. Many elderly develop stress over the idea of scheduling some permanent type of “work” each week, but with most of these programs, you can volunteer once a week, once a month, or 40 hours a week.<br />Most of these programs don’t offer monetary gain for the volunteers, but they do offer free training, and some even offer supplemental insurance- so look into that!<br />The difficulty for many seniors is finding these outlets. Now that I’ve mentioned some of them, take your internet savvy self to look at each of them, decide which one has the best outlets for those that you love, and make some phone calls to help point your beloved senior in the right direction! Below I’ll put up some links for the programs I’ve listed above.<br />http://www.americantowns.com/or/keizer/volunteers/seniors<br />http://www.nationalservice.gov/programs/senior-corps<br />https://www.facebook.com/MarionCountyRetiredSeniorVolunteerProgram<br />http://www.aplaceformom.com/blog/9-26-14-reasons-seniors-volunteer/",
      "categories": ["Missing loved ones", "Volunteering"]
    },
    {
      "id": 8,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Fiber Me!",
      "author": "Margie Hibner",
      "description": "I hear it all of the time as a Physical Therapist.",
      "date": "22 September 2014",
      "body": "I hear it all of the time as a Physical Therapist. Many of our adult foster home residents and my patients sigh heavily and voice concern over taking narcotics, often due both to upset tummy’s, as well as some serious constipation. Many people have issues with bowel movements already, but throw in some pain medication, and you’re likely to be stopped up like an old shower drain. Let me tell you below what I know being in my line of work about constipation, what causes it, and how we can help get things moving! Use the information below to help yourself, a friend, or a family member.<br />Of course there are other causes of constipation that you should also try to rectify as best you can. Things like not drinking enough water and not exercising much will slow down all of the work your insides are trying to do. Older people in general tend to drink less water and move less, so motivating them to do both of these can be helpful. A sometimes simple fix is to cut back on foods that often lead to halting your guts, like eggs and cheese. Also be on the lookout if a loved one takes an anti depressant medication, as some doctors say that certain anti depressants can have the nasty side effect of constipation.<br />The issue I see the most though, is acute constipation with people taking pain medication, as the reason people are in Physical Therapy is because of pain. When a person is prescribed a narcotic, it is typically for a darn good reason, and the person should take it as prescribed. If the modifications suggested below are not helpful for you or a loved one, then make sure to get back in contact with your health care professional, as there are other pain medication options you could try. Most people end up with a catch 22, with the option of either feeling the pain from the injury, the treatment, or the disease, and/or the pain of being constipated. Along with trying to crank up your water intake and up your exercising (even gentle moving will help), I found a great article with some quick and easy options to add fiber into your diet. Changing someone’s diet can be tricky, changing a person who has had the same diet for 75 years… even trickier. Teaching an old dog new tricks definitely isn’t easy, but it can be done!!! Change/add only one or two foods at a time.<br />For those that do not like water, you can add some fresh squeezed lemon/lime juice or wedge to the water. Sometimes you can dilute their favorite juice with water. There are products that allow you to squeeze a variety of flavors into water, there is flavored water and flavored carbonated water too. Here are some of the quick and easy ideas for adding some fiber to a diet that I liked from an article I recently read. Hopefully you too, can take home some pointers and help yourself or a senior loved one add a little extra fiber into their diet. There’s additional information in this link to specific high fiber foods and the amount (in grams) of fiber you or your loved one should shoot to attain. This will also hopefully help decrease some anxiety with taking those darn pain pills!<br />Serve an easy to make fruit salad.<br />Eat a fresh orange rather than drinking juice.<br />Eat the skins of apples and pears.<br />Don’t peel your potatoes — include the skins that also contain the most nutrition.<br />Buy 100-percent whole grain breads instead of refined white bread.<br />Add more vegetables to your stews or soup.<br />Choose bran muffins instead of chocolate chip muffins.<br />Snack on nuts, which are rich in fiber and healthy fats.<br />Add fresh berries to your favorite yogurt.<br />Substitute whole wheat flour for half of the white flour in your recipes.<br />Eat oatmeal or oat cereals for breakfast and add some flax seeds for some healthy fats.<br />Serve baked beans as a side dish.<br />So get to packing that fridge full of berries while they are still in season and start leaving a few bowls of nuts on the tables around your (or their) home. These are great ways to sneak in just a little extra fiber that may make things a little… easier.<br />Of course, if you or a loved one have additional questions or are suffering from severe or chronic constipation, go talk to a medical professional so they can do the full work up and provide you with additional means of combating this frustrating issue!<br />http://nutrition.about.com/od/foodfun/a/high_fiber_food.htm#",
      "categories": ["Physical Therapy", "Medication"]
    },
    {
      "id": 9,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "A Day of Gratitude for our Salem area World War II Veterans",
      "author": "Margie Hibner",
      "description": "A few weeks ago I got to experience a great afternoon in downtown Salem, where my hometown put up a new memorial to honor our World War II veterans from the area.",
      "date": "19 August 2014",
      "body": "A few weeks ago I got to experience a great afternoon in downtown Salem, where my hometown put up a new memorial to honor our World War II veterans from the area. I myself, like many others, probably don’t give thanks frequently enough to those that fight for our country, so I appreciate all memorials that act as a permanent reminder to always be grateful.<br />The weather was VERY warm, but that did not stop the crowds. There was standing room only. People sought out the shaded areas and brought fans, cold water and umbrellas to keep them cool.  Many of the crowd were seniors from ‘the greatest generation.’ They came out in full force to honor and remember the World War II Salem area veterans.  I made sure to arrive early, so that I didn’t miss a moment of the dedication. To start off the event, a short speech was delivered about the memorial itself, those who created it, and the reason for its placement.  A World War II veteran living in Bend, Oregon delivered a speech reminiscing about the people that he had served with during the war.  Governor Kitzhaber and other military personal said a few words as well.<br />The crowd was littered with men and women from the military donning caps, medals, or jackets declaring what part of the service they were from. The most impressive thing to me was the salutes. The  majority of the crowd may have been over 80 and using walkers, canes, and needing assist to stand, (some could not stand), but when it came time to salute, those salutes were sharp and steady. It gave me chills to see these veterans perform a sincere dedicated salute regardless of their physical abilities. The look in their eyes was complete love for their country, with full understanding of what it means to fight for one’s country and if necessary, they would do it again.<br />We, at Premier Care Homes, are lucky enough to have World War II veterans living in our homes. One of our veterans, Don Marlarkey was able to attend the dedication today with his family and friends at his side. The dedication brought many emotions to the surface for everyone, but the most prominent feeling was of pride and gratitude.<br />At the end of the dedication, everybody was in high spirits and very appreciative of the efforts to create a lifetime memorial to the World War II veterans in the Salem area. Most importantly, the day, and the memorial act as a good reminder to myself and to others to always be grateful towards those who put their own lives in danger to protect our freedom.",
      "categories": ["Physical Therapy", "Medication"]
    },
    {
      "id": 10,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Animals and Seniors",
      "author": "Janelle Leavell",
      "description": "Here at Premier Care Homes, the owners frequently visit the homes and bring their dogs with them to visit with the residents.",
      "date": "08 July 2014",
      "body": "Here at Premier Care Homes, the owners frequently visit the homes and bring their dogs with them to visit with the residents. We understand that some people have mixed reviews on animals. We like to think that most people enjoy the company of a furry friend. We think that a person’s exposure (positive and negative) to animals is what weighs so heavily into their own idea of love or dislike towards pets.<br />We always keep in mind the fact that certain people just may not have an affinity for animals, but we do like to help create good memories and provide motivation with our furry friends. We have no intention of pushing any pets on the residents, instead we like to wash away any ill-conceived notion that a poorly behaved animal may have brought on for them.<br />We believe that animals can be used positively to uplift people, and specifically speaking, residents of our homes. I like to take my large old rescue dog, Red, along for car rides and tours of the home, to lay with and play with anyone who will give him some attention. Many, if not all, of the residents Red has come in contact with respond well, and are tickled when he sits on their feet. Red has been taken on walks by residents and loves to be groomed. Grooming does happen outside as he sheds like crazy! Red will play fetch and we allow the ball to be thrown in the house during rainy/cold weather. I am not sure who is happier about that, the residents or Red!! My business partner brings her small dog Lucy who loves to sit in laps. She should be bald after all the ‘petting’ she gets!! Lucy also plays fetch. Both dogs are well behaved.<br />If you are trying to decide whether we at Premier Care Homes are right for you, know that we can provide your loved one some extra company. Know also that we respect everyone’s privacy, and if they’d rather not interact, with the dogs we will respect that.<br />I’d like to share some of the benefits that I’ve seen first hand over the years, both as a Physical Therapist and as an owner of Premier Care Homes, of animals interacting with people:<br />1) Animals can improve a person’s social and emotional wellbeing. Animals provide many people, elderly especially, the opportunity to love and cuddle without care or judgment. Animals can give residents easy, light topics of conversation, encouraging them to engage, as well as help them reminisce about a favorite or least favorite pet/animal experience.<br />2) Animals can help improve cognitive function.<br />3) Animals can help to be a motivating factor, especially physically. Animals, and especially our dogs Red and Lucy love to be pet, groomed, taken for walks, fed treats, and played with. If Red or Lucy can’t get someone to throw their ball with those big (they call them puppy dog eyes for a reason) eyes, I’m not sure who or what will!<br />Our personal experiences aside, here’s an article from Ed Kane, PhD who also strongly believes in having pets around with seniors.<br />http://www.petpartners.org/document.doc?id=316  (copy and paste into your browser)<br />“A pet is a medication without side effects that has so many benefits. I can’t always explain it myself, but for years now I’ve seen how instances of having a pet is like an effective drug. It really does help people.”<br />Dr. Edward Creagan<br />Oncologist at Mayo Clinic, Rochester, MN<br /><img src='http://www.premiercarehomes.net/wp-content/uploads/2014/07/Louis-and-Dog-225x300.jpg' />",
      "categories": ["Physical Therapy", "Medication"]
    },
    {
      "id": 11,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "A Busy Birthday Month for Premier Care Homes",
      "author": "Janelle Leavell",
      "description": "May was a busy birthday month for us. We have had multiple birthdays this month in more than one of our homes.",
      "date": "20 May 2014",
      "body": "May was a busy birthday month for us. We have had multiple birthdays this month in more than one of our homes. We celebrated over 380 years of living with four of our seniors. With over 380 years of life lived, there are lots of stories shared. At Premier Care Homes, we love to listen and learn.<br />Each birthday was celebrated and honored differently. In each case, we at Premier Care Homes made sure to wish the resident happy birthday, give them a musical birthday card, and provide them with a dessert of their choice.<br />Even more importantly, the resident’s get to spend time with their families, planning their special day. In one case, the family chose to celebrate their “loved ones” birthday at a nephew’s home. The family took the resident with them to the nephew’s house, where they spent the day celebrating 100 years of living, as well as socializing and enjoying food made by family and friends.<br />In another case, we celebrated with the resident within the home. We baked her a cake and her son came by to enjoy the celebration of 102 years. No, we weren’t able to fit 102 candles on that cake! Birthday cards sent to the resident were proudly displayed in her room.<br />Regardless of how everyone chose to spend their birthdays, it was apparent that each special day was enjoyed, and at Premier Care Homes, we want to do our best to ensure this. Sometimes being busy can be stressful, but a month scattered with birthdays keeps us all busy in the best way, and we love more reasons to celebrate our seniors!<br />Our decision was finally made to move forward when we made a list of concerns we were repeatedly witnessing on a daily basis:<br />Substandard care in large facilities for lower functioning individuals.<br />We would often hear from families and observe in larger facilities that their care needs were not being met, such as:<br />        Residents with dementia were often very anxious because they were unsure of the unfamiliar surroundings. There was no one around to comfort and reassure them.<br />        Residents waiting 30 minutes to get assistance to use the restroom.<br />        A resident had fallen and been on the floor for several hours because no one had checked on them and they were unable to remember to use the “call light”.<br />        A resident who wanted to isolate themselves in their room because the large facility was overwhelming and made them feel uncomfortable.<br />Need for  healthcare professionals operating Adult Foster Care Homes.<br />As home health physical therapists working with patients in AFCH’s, we found  that residents moving into an AFCH were becoming increasingly more medically fragile and requiring more memory care. With this change in the level of care that was needed for these “seniors”, it was obvious that healthcare professionals needed to be operating these homes to provide the oversight and quality of care they needed.<br />Need for more individualized care.<br />Adult Foster Care Homes have a 1:5 caregiver to resident ratio. No other care facilities have a ratio this low, therefore we knew that a “senior” in an Adult Foster Care home would have more individualized care, such as getting assistance to the bathroom in a timely manner, receiving assistance with an exercise program, or a caregiver spending time talking with each resident during the day, etc.<br />A home-like, small environment.<br />When the time comes for seniors to move out of their homes, it is comforting for them to move into a home-like environment. The change from living in their home is not as drastic if they move into a place that is similar to home with a caregiver who can assist with their daily needs.<br />Less expensive.<br />Many “seniors” are on a very limited income and are unable to afford some of the high costs of larger facilities. Adult Foster Care Homes are a much more affordable alternative to higher priced facilities.<br />After completing this list, researching the details on how to open an Adult Foster Care home, and taking Adult Foster Care Home classes, we opened our first home in September 2008. There have been many bumps along the way and many sacrifices our own families have made, but every time we have a family member tell us how thankful they are that their mom or dad moved into our home, we know we have made the right choice.<br />We hope that this list inspires you to choose an Adult Foster Care home for your loved one.",
      "categories": ["Physical Therapy", "Medication"]
    },
    {
      "id": 12,
      "mainImage": "https://source.unsplash.com/YmQ0-nmWcV0/640x360",
      "title": "Babies Bring Joy to the World, and Joy to Our Homes",
      "author": "Janelle Leavell",
      "description": "At Premier Care Homes, we love having visitors stop by the houses. Our residents enjoy it as well! ",
      "date": "25 February 2014",
      "body": "At Premier Care Homes, we love having visitors stop by the houses. Our residents enjoy it as well! This month, many of the homes were lucky enough to be graced with the presence of some tiny babies! Margie Hibner, one of the owners, became a Grandma in August (twice over), and took her grandbabies out for some visiting.<br />It’s hard not to love every child, and these babies were certainly getting their share of that attention. Each baby was passed around to sit in laps, practice clapping with the residents, show off their rolling skills, and cuddle. If residents were extra lucky, the babies even held still long enough to take bottles from them!<br />The visits were a great success, and brought about rounds of smiles and laughter from all involved. Along with all of that laughter came different stories from each resident, ranging from some their own childhood memories, to many memories about babies of their own (or their babies, babies, babies ). We have some wonderful photos of the residents snuggling with the Grandbabies for your enjoyment below.<br />http://www.petpartners.org/document.doc?id=316  (copy and paste into your browser)<br />'A pet is a medication without side effects that has so many benefits. I can’t always explain it myself, but for years now I’ve seen how instances of having a pet is like an effective drug. It really does help people.'<br />Dr. Edward Creagan<br />Oncologist at Mayo Clinic, Rochester, MN<br /><img src='http://www.premiercarehomes.net/wp-content/uploads/2014/07/Louis-and-Dog-225x300.jpg' />",
      "categories": ["Physical Therapy", "Medication"]
    }
  ]
}
