{
  "facilities": [
    {
      "id": 1,
      "name": "Baxter",
      "summary": "This serene and flawless affiliated home is located in the West Bennett Park neighborhood in Southeast Salem.",
      "description": "This serene and flawless affiliated home is located in the West Bennett Park neighborhood in Southeast Salem.",
      "images": [],
      "location": "https://www.google.com/maps/place/2336+Baxter+Rd+SE,+Salem,+OR+97306/@44.8772138,-123.015077,17z/data=!3m1!4b1!4m5!3m4!1s0x54c00777977d5563:0x3dad85c1af882986!8m2!3d44.87721!4d-123.0128883&output=embed"
    },
    {
      "id": 2,
      "name": "Hallet",
      "summary": "This one-level home provides a small intimate setting with a private bedroom afforded to each of the five residents. ",
      "description": "Located in a beautiful West Salem neighborhood, this home is secure and pristine. This one-level home provides a small intimate setting with a private bedroom afforded to each of the five residents.<br>For daily living and activities, the communal space is a large light-filled area that has been newly decorated and furnished. The private, well-kept grounds and patio allow residents to enjoy the tranquillity of the outdoors.",
      "images": [],
      "location": "https://maps.google.com/maps?q=1548%20Hallet%20Ct.%20NW&t=&z=13&ie=UTF8&iwloc=&output=embed"
    },
    {
      "id": 3,
      "name": "Madrona",
      "summary": "Our comfortable immaculate home is located in the delightful Laurel Springs neighborhood in South Salem. ",
      "description": "Our comfortable immaculate home is located in the delightful Laurel Springs neighborhood in South Salem. This one-level home provides a small intimate setting with a private bedroom afforded to each of the five residents.<br>For daily living and activities, the communal space is a large light-filled area that has been newly decorated and furnished. The private, well-kept grounds and patio allow residents to enjoy the tranquillity of the outdoors.",
      "images": [],
      "location": "https://www.google.com/maps/place/1270+Madrona+Ave+S,+Salem,+OR+97302/@44.9054847,-123.0663443,17z/data=!3m1!4b1!4m5!3m4!1s0x54c000b609ed573d:0x7273f9df8ba6a111!8m2!3d44.9054809!4d-123.0641556&output=embed"
    },
    {
      "id": 4,
      "name": "Trapper",
      "summary": "This comfortable and impeccable home is located in a beautiful Northeast Salem neighborhood near Chemeketa Community College. ",
      "description": "This comfortable and impeccable home is located in a beautiful Northeast Salem neighborhood near Chemeketa Community College. This one-level home provides a small intimate setting with a private bedroom afforded to each of the five residents.<br>For daily living and activities, the communal space is a large light-filled area. The private, well-kept grounds and patio allow residents to enjoy the tranquillity of the outdoors.",
      "images": [],
      "location": "https://www.google.com/maps/place/4322+Trapper+Dr+NE,+Salem,+OR+97305/@44.9820723,-122.9652277,17z/data=!3m1!4b1!4m5!3m4!1s0x54bffdce4ddd23a3:0x9a4fa5057520e4d!8m2!3d44.9820686!4d-122.960743&output=embed"
    }
  ]
}
