{
  "testimonials": [
    {
      "quote": "Thank you so very much for taking such good care of Pop when he stayed there… You have made a wonderful facility to care for people.",
      "author": "Leah"
    },
    {
      "quote": "I'm writing to thank both of you for providing such great care for our mom over the past year. Both of you (Janelle and Margie) and your staff were wonderful -- both in mom's day to day care and in involving us and keeping us in the loop. We felt total confidence in you having the best interests of your clients in mind (and heart), and that is no small thing in this world… Thanks again for everything you do.",
      "author": "Cathy"
    },
    {
      "quote": "We truly believe God put you in our lives to care for mom. It was such a comfort to know she had 24 hour care. Watching you and mom together: trust and kindness. Thanks.",
      "author": "JoAnn"
    },
    {
      "quote": "I want to take this opportunity to tell you how much we appreciated you and the care you gave our mom. From the first night you let me stay to the end of mom's life, you took good care of her and we knew she was safe and not alone… Thank you for what you do.",
      "author": "Shirley"
    },
    {
      "quote": "You and your staff have done wonders with my step mother. Her health and attitude have improved tremendously in the month she has been living at your Juneau home. My sister and I have always promised my step mother that if she regains her strength and abilities and keeps up the positive attitude, she could return to her own home to live, with some hired help… Thank you for your services. Helen has returned to a level of strength and engagement we didn't dream was still possible. We hope she will continue to thrive within her own home for some time to come.",
      "author": "Michelle"
    },
    {
      "quote": "I would like to thank you for all of your loving kindness and care provided to my father. Your lovely home, your overall mission, and the way you carried out that mission was a true blessing to my father and to our entire family. It truly felt like a comfortable second home and family. My dad always remarked on how lovely the home was. It was a pleasure working with you, and getting to know you. With your permission, I would love to give out your name to patients and families if the need arises for such personalized, loving care. Thank you again for opening your home and hearts to my dad and our family.",
      "author": "Ed & Cheryl"
    }
  ]
}
